; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v2 ?v8)
             (pred_5 ?v12 ?v13)
             (pred_3 ?v2 ?v13)
             (pred_10 ?v1 ?v2 )
	     (pred_2 ?v2)
             (pred_1 ?v3)
             (pred_7 ?v12)
             (pred_12 ?v13)
             (pred_11 ?v2)
             (pred_9 ?v12)
             (pred_8 ?v2)
             (pred_6 ))



(:action op_5
:parameters (?v5 ?v10 ?v4 ?v11)
:precondition (and (pred_1 ?v5) (pred_1 ?v10) (pred_7 ?v4) (pred_12 ?v11)
          (pred_4 ?v5 ?v10) (pred_5 ?v4 ?v11)
                   (pred_3 ?v10 ?v11) (pred_2 ?v5) 
                   (pred_11 ?v10) (pred_9 ?v4))
:effect (and  (pred_8 ?v10) (not (pred_11 ?v10))))


(:action op_2
:parameters (?v5 ?v9)
:precondition (and (pred_1 ?v5) (pred_1 ?v9)
               (pred_2 ?v5) (pred_4 ?v5 ?v9) (pred_8 ?v9))
:effect (and (pred_2 ?v9) (not (pred_2 ?v5))))

(:action op_1
:parameters (?v5 ?v4)
:precondition (and (pred_1 ?v5) (pred_7 ?v4) 
                  (pred_2 ?v5) (pred_10 ?v4 ?v5) (pred_6 ))
:effect (and (pred_9 ?v4)
   (not (pred_10 ?v4 ?v5)) (not (pred_6 ))))


(:action op_4
:parameters (?v5 ?v6 ?v7)
:precondition (and (pred_1 ?v5) (pred_7 ?v6) (pred_7 ?v7)
                  (pred_2 ?v5) (pred_9 ?v7) (pred_10 ?v6 ?v5))
:effect (and (pred_9 ?v6) (pred_10 ?v7 ?v5)
        (not (pred_9 ?v7)) (not (pred_10 ?v6 ?v5))))

(:action op_3
:parameters (?v5 ?v4)
:precondition (and (pred_1 ?v5) (pred_7 ?v4) 
                  (pred_2 ?v5) (pred_9 ?v4))
:effect (and (pred_6 ) (pred_10 ?v4 ?v5) (not (pred_9 ?v4)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_12 obj_01 obj_08 obj_18 obj_06 obj_16 obj_02 obj_10 obj_04 obj_19 obj_11 obj_13 obj_03 obj_20 obj_09 obj_17
    obj_15 obj_14
    obj_05 obj_07
    )

    (:init
       (pred_6)

       (pred_1 obj_12)
       (pred_1 obj_01)
       (pred_1 obj_08)
       (pred_1 obj_18)
       (pred_1 obj_06)
       (pred_1 obj_16)
       (pred_1 obj_02)
       (pred_1 obj_10)
       (pred_1 obj_04)
       (pred_1 obj_19)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_03)
       (pred_1 obj_20)
       (pred_1 obj_09)
       (pred_1 obj_17)
       (pred_12 obj_15)
       (pred_12 obj_14)
       (pred_7 obj_05)
       (pred_7 obj_07)

       (pred_4 obj_12 obj_06)
       (pred_4 obj_12 obj_01)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_01 obj_08)
       (pred_4 obj_01 obj_12)
       (pred_4 obj_08 obj_02)
       (pred_4 obj_08 obj_18)
       (pred_4 obj_08 obj_01)
       (pred_4 obj_18 obj_10)
       (pred_4 obj_18 obj_08)
       (pred_4 obj_06 obj_04)
       (pred_4 obj_06 obj_16)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_16 obj_19)
       (pred_4 obj_16 obj_02)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_06)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_02 obj_10)
       (pred_4 obj_02 obj_08)
       (pred_4 obj_02 obj_16)
       (pred_4 obj_10 obj_13)
       (pred_4 obj_10 obj_18)
       (pred_4 obj_10 obj_02)
       (pred_4 obj_04 obj_03)
       (pred_4 obj_04 obj_19)
       (pred_4 obj_04 obj_06)
       (pred_4 obj_19 obj_20)
       (pred_4 obj_19 obj_11)
       (pred_4 obj_19 obj_16)
       (pred_4 obj_19 obj_04)
       (pred_4 obj_11 obj_09)
       (pred_4 obj_11 obj_13)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_11 obj_19)
       (pred_4 obj_13 obj_17)
       (pred_4 obj_13 obj_10)
       (pred_4 obj_13 obj_11)
       (pred_4 obj_03 obj_20)
       (pred_4 obj_03 obj_04)
       (pred_4 obj_20 obj_09)
       (pred_4 obj_20 obj_19)
       (pred_4 obj_20 obj_03)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_11)
       (pred_4 obj_09 obj_20)
       (pred_4 obj_17 obj_13)
       (pred_4 obj_17 obj_09)
       (pred_11 obj_20)
       (pred_11 obj_08)
       (pred_3  obj_20 obj_15)
       (pred_3  obj_08 obj_14)
       (pred_8 obj_12)
       (pred_8 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_06)
       (pred_8 obj_16)
       (pred_8 obj_02)
       (pred_8 obj_10)
       (pred_8 obj_04)
       (pred_8 obj_19)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_03)
       (pred_8 obj_09)
       (pred_8 obj_17)

       (pred_5  obj_05 obj_15)
       (pred_5  obj_07 obj_14)
       (pred_10 obj_05 obj_18)
       (pred_10 obj_07 obj_10)
       (pred_2 obj_13)
    )

    (:goal (and
       (pred_10 obj_05 obj_01)
       (pred_10 obj_07 obj_03)
    ))
(:constraints
  (always (not (pred_2 obj_08)))
)
)

; plan
1. (op_2 obj_13 obj_11)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_11)
   goals met: 0 of 2
2. (op_2 obj_11 obj_19)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_19)
   goals met: 0 of 2
3. (op_2 obj_19 obj_16)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_16)
   goals met: 0 of 2
4. (op_2 obj_16 obj_02)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_02)
   goals met: 0 of 2
5. (op_2 obj_02 obj_10)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_10)
   goals met: 0 of 2
6. (op_1 obj_10 obj_07)
   deleted: (pred_10 obj_07 obj_10) (pred_6)
   added: (pred_9 obj_07)
   goals met: 0 of 2
7. (op_2 obj_10 obj_02)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_02)
   goals met: 0 of 2
8. (op_3 obj_02 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_6) (pred_10 obj_07 obj_02)
   goals met: 0 of 2
9. (op_2 obj_02 obj_10)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_10)
   goals met: 0 of 2
10. (op_2 obj_10 obj_18)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_18)
   goals met: 0 of 2
11. (op_1 obj_18 obj_05)
   deleted: (pred_10 obj_05 obj_18) (pred_6)
   added: (pred_9 obj_05)
   goals met: 0 of 2
12. (op_2 obj_18 obj_10)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_10)
   goals met: 0 of 2
13. (op_2 obj_10 obj_02)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_02)
   goals met: 0 of 2
14. (op_2 obj_02 obj_16)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_16)
   goals met: 0 of 2
15. (op_2 obj_16 obj_01)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_01)
   goals met: 0 of 2
16. (op_3 obj_01 obj_05)
   deleted: (pred_9 obj_05)
   added: (pred_6) (pred_10 obj_05 obj_01)
   goals met: 1 of 2
17. (op_2 obj_01 obj_16)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_16)
   goals met: 1 of 2
18. (op_2 obj_16 obj_02)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_02)
   goals met: 1 of 2
19. (op_1 obj_02 obj_07)
   deleted: (pred_10 obj_07 obj_02) (pred_6)
   added: (pred_9 obj_07)
   goals met: 1 of 2
20. (op_2 obj_02 obj_16)
   deleted: (pred_2 obj_02)
   added: (pred_2 obj_16)
   goals met: 1 of 2
21. (op_2 obj_16 obj_06)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_06)
   goals met: 1 of 2
22. (op_2 obj_06 obj_04)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_04)
   goals met: 1 of 2
23. (op_2 obj_04 obj_03)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_03)
   goals met: 1 of 2
24. (op_3 obj_03 obj_07)
   deleted: (pred_9 obj_07)
   added: (pred_6) (pred_10 obj_07 obj_03)
   goals met: 2 of 2
